# Данное слово, которое мы будем использовать
word = "объектно-ориентированный"

# Срезаем слово "объект" 
objekt = word[:6]

# Срезаем слово "ориентир" 
orientir = word[9:17]

# Срезаем слово "тир" 
tir = word[14:17]

# Срезаем слово "кот" 
kot = word[4]+word[0]+word[5]

# Срезаем слово "рента" 
renta = word[10]+word[12:15]+word[19]

# Выводим полученные слова на экран
print("Слово 'объект':", objekt)
print("Слово 'ориентир':", orientir)
print("Слово 'тир':", tir)
print("Слово 'кот':", kot)
print("Слово 'рента':", renta)
