# Создаем переменную для хранения количества предложений с цифрами, изначально она равна 0.
count_sentences_with_digits = 0

# Вводим количество предложений (n) от пользователя.
n = int(input("Введите количество предложений: "))

# Цикл для обработки каждого предложения.
for i in range(n):
    sentence = input("Введите предложение: ")  # Вводим предложение от пользователя.

    # Проверяем каждый символ в предложении.
    for char in sentence:
        if char.isdigit():  # Если символ является цифрой,
            count_sentences_with_digits += 1  # увеличиваем счетчик на 1 и выходим из цикла.
            break

# Выводим результат.
print(f"Из {n} предложений {count_sentences_with_digits} содержат хотя бы одну цифру.")2
