# Создаем базу данных магазина
shop = [['каретка', 1200], ['шатун', 1000], ['седло', 300], ['педаль', 100], ['седло', 1500], ['рама', 12000], ['обод', 2000], ['шатун', 200], ['седло', 2700]]

# Создаем переменные для подсчета количества и общей стоимости деталей
total_quantity = 0
total_cost = 0

# Запрашиваем у пользователя название детали
desired_item = input("Название детали: ")

# Проходим по списку деталей в магазине
for item in shop:
    # Проверяем, совпадает ли название детали с введенным пользователем
    if item[0] == desired_item:
        # Если совпадает, увеличиваем количество и общую стоимость
        total_quantity += 1
        total_cost += item[1]

# Выводим результаты
print(f"Кол-во деталей — {total_quantity}")
print(f"Общая стоимость — {total_cost}")
